Revit 2027 API
BuiltInFailures.OpeningFailures.HostForCutHasNoGeometry Property
 Host can't be cut because it has no geometry.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static FailureDefinitionId HostForCutHasNoGeometry { get; }
Public Shared ReadOnly Property HostForCutHasNoGeometry As FailureDefinitionId
	Get
public:
static property FailureDefinitionId^ HostForCutHasNoGeometry {
	FailureDefinitionId^ get ();
}
static member HostForCutHasNoGeometry : FailureDefinitionId with get
Property Value
FailureDefinitionId
See Also
Reference
BuiltInFailures.OpeningFailures Class
Autodesk.Revit.DB Namespace